app/controllers/client_controller.rb

SELECT `clients`.* FROM `clients`
---
    def index
        @client = Client.all

SELECT `clients`.* FROM `clients` WHERE `clients`.`nickname` = 'LMs' AND `clients`.`password` = '1233'
SELECT 1 AS one FROM `clients` WHERE `clients`.`nickname` = 'LMs' LIMIT 1
---
    def login
        @client = Client.find_by(nickname: params[:nickname], password: params[:password])

        if @client.present?

INSERT INTO `clients` (`name`, `nickname`, `password`, `token`, `created_at`, `updated_at`) VALUES ('David', 'LMs', '1233', '8e4cbd4e-a15e-406d-ae53-0b47e1bf6270', '2023-05-27 00:29:57.904165', '2023-05-27 00:29:57.904165')
---
    def create #poner privadas las funciones
        @client = Client.create(client_params)

SELECT `clients`.* FROM `clients` WHERE `clients`.`nickname` = 'LMs' AND `clients`.`password` = '1233'
---
    def login
        @client=Client.where(nickname: params[:nickname], password: params[:password])
        if @client.present?

SELECT `clients`.* FROM `clients` WHERE `clients`.`token` = '8e4cbd4e-a15e-406d-ae53-0b47e1bf6270' LIMIT 1
---
    def check_token
        token = request.headers["Authorization"].split(" ") #Tengo que usar split porque el front envía "Bearer token" y solo necesito el token.
        @client=Client.find_by(token: token[1])#En token[0] queda "Bearer"