app/controllers/isp_controller.rb

SELECT `isps`.* FROM `isps`
---
    def index
        @isp=Isp.all

SELECT `isps`.* FROM `isps` WHERE `isps`.`name_isp` = 'isp1' AND `isps`.`password` = '1233'
SELECT 1 AS one FROM `isps` WHERE `isps`.`name_isp` = 'isp1' LIMIT 1
---
    def login
        @isp=Isp.find_by(name_isp: params[:name_isp], password: params[:password])

        if @isp.present?

INSERT INTO `isps` (`name_isp`, `password`, `token`, `created_at`, `updated_at`) VALUES ('isp1', '1233', 'a4799f63-0bc0-4c0a-85a6-bdb8fbd81a6e', '2023-05-27 00:45:47.567421', '2023-05-27 00:45:47.567421')
---
    def create #poner privadas las funciones
        @isp = Isp.create(params.permit(:name_isp, :password))

SELECT `isps`.* FROM `isps` WHERE `isps`.`name_isp` = 'isp1' AND `isps`.`password` = '1233'
---
    def login
        @isp=Isp.where(name_isp: params[:name_isp], password: params[:password])
        if @isp.present?

SELECT `isps`.* FROM `isps` WHERE `isps`.`token` = 'a4799f63-0bc0-4c0a-85a6-bdb8fbd81a6e' LIMIT 1
---
    def check_token
        token = request.headers["Authorization"].split(" ") #Tengo que usar split porque el front envía "Bearer token" y solo necesito el token.
        @isp=Isp.find_by(token: token[1])#En token[0] queda "Bearer"