app/controllers/plan_controller.rb

SELECT `plans`.* FROM `plans`
---
        def index
            @plan = Plan.all

SELECT `isps`.* FROM `isps` WHERE `isps`.`name_isp` = 'isp1' LIMIT 1
INSERT INTO `plans` (`name_plan`, `isp_id`, `band_width`, `simetric`, `created_at`, `updated_at`) VALUES ('Plan 50 Megas', 1, '50', TRUE, '2023-05-27 02:20:47.911593', '2023-05-27 02:20:47.911593')
---
        def create
            @isp = Isp.find_by(name_isp: params[:isp_plan])

            if @isp
                @plan = @isp.plans.create(
                name_plan: params[:name_plan],
                band_width: params[:band_width],
                simetric: params[:simetric]
                )

SELECT `clients`.* FROM `clients` WHERE `clients`.`token` = '1ff75e99-162c-46dc-9459-5f508a5a7134' LIMIT 1
SELECT `isps`.* FROM `isps` WHERE `isps`.`token` = '1ff75e99-162c-46dc-9459-5f508a5a7134' LIMIT 1
---
    def check_token
        token = request.headers["Authorization"].split(" ") #Tengo que usar split porque el front envía "Bearer token" y solo necesito el token.
        @client=Client.find_by(token: token[1])#En token[0] queda "Bearer"
        @isp=Isp.find_by(token: token[1])#En token[0] queda "Bearer"