app/controllers/request_controller.rb

    def create
        @client = Client.find_by(nickname: params[:nickname])
        @isp = Isp.find_by(name_isp: params[:name_isp])
        @plan = Plan.find_by(name_plan: params[:name_plan])

        if @client && @isp && @plan
          @request = @client.requests.create(
            numberRequest: SecureRandom.uuid,
            plan: @plan,
            isp: @isp
          )
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`nickname` = 'LMs' LIMIT 1
SELECT `isps`.* FROM `isps` WHERE `isps`.`name_isp` = 'isp1\n' LIMIT 1
SELECT `plans`.* FROM `plans` WHERE `plans`.`name_plan` = 'Plan 50 Megas' LIMIT 1
INSERT INTO `requests` (`numberRequest`, `acceptRequest`, `client_id`, `plan_id`, `isp_id`, `created_at`, `updated_at`) VALUES ('7737cd32-04f8-41bc-aa1e-be4c6725c987', NULL, 1, 1, 1, '2023-05-27 03:18:42.677289', '2023-05-27 03:18:42.677289')

    def check_token
        token = request.headers["Authorization"].split(" ") #Uso split para separar el token de las comillas y solo necesito el token.
        @client=Client.find_by(token: token[1])#En token[0] queda "Bearer"

        return if @client.present?
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`token` = '6aaa9171-a8b8-4987-8d60-fde037f172a4' LIMIT 1